//початковий об'єкт з послугами та їх цінами
var services = {
    "стрижка": "60 грн",
    "гоління": "80 грн",
    "Миття голови": "100 грн"
};

//обчислення та повернення загальної вартості наданих послуг
function price() {
    var total = 0; //початкова загальна сума
    
    //перебір всіх властивостей об'єкта
    for (var key in services) {
        //перетворення ціни з рядка в число
        var price = parseFloat(services[key]); //перетворення вартості послуг в число
        total += price; //додаємо до загальної суми
    }
    return total + " грн"; //повертаємо загальну вартість
}


//повернення min ціни
function minPrice() {
    var min = Infinity; //початкова мінімальна ціна (+ незкінченність)

    //перебір всіх властивостей об'єкта
    for (var key in services) {
        var price = parseFloat(services[key]); //перетворення вартості послуг в число
        if (price < min) {
            min = price; //оновлення мінімуму, якщо поточна ціна < min
        }
    }
    return min + " грн"; //повертаємо мінімальну ціну
}

//повернення max ціни
function maxPrice() {
    var max = -Infinity; //початкова мінімальна ціна (- незкінченність)
   
    //перебір всіх властивостей об'єкта
    for (var key in services) {
        var price = parseFloat(services[key]); //перетворення вартості послуг в число
        if (price > max) {
            max = price; //оновлення максимуму, якщо поточна ціна > max
        }
    }
    return max + " грн"; //повертаємо максимальну ціну
}

//виведення початкових значень об'єкту
console.log("Загальна вартість послуг:", price());
console.log("Мінімальна ціна:", minPrice());
console.log("Максимальна ціна:", maxPrice());

//додавання нової послуги
services['Розбити скло'] = "200 грн";

//виведення початкових значень об'єкту
console.log("Загальна вартість послуг після додавання нової:", price());
console.log("Мінімальна ціна після додавання нової:", minPrice());
console.log("Максимальна ціна після додавання нової:", maxPrice());