function pow(x, y) {
  let result = 1; // початкове значення змінної результату задано 1

  // задаємо логіку циклу, який виконається y разів, щоб помножити x на результат кожної ітерації
  for (let i = 0; i < Math.abs(y); i++) {
      result *= x; // множимо х на поточний результат ітерації
  }
  //задаємо умову коли 0 у 0 степені
  if (x === 0 && y === 0) {
      return NaN;
    }
    
  // задаємо умову коли будь-яке число у 0 степені
  if (y === 0) {
      return 1;
    }

  if (y < 0) {
      return 1 / result;
  }
    

  return result; // повертаємо кінцевий результат після завершення циклу
}

// виклик функції та виведення результату
console.log(pow(2, 3)); // Очікуваний результат: 8
console.log(pow(0, 0)); // Очікуваний результат: NaN
console.log(pow(5, 0)); // Очікуваний результат: 1
console.log(pow(-2, 3)); // Очікуваний результат: -8
console.log(pow(2, -3)); // Очікуваний результат: 0.125